blog-posts/2003-11-21-cool-elisp-hack.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Cool elisp hack!</title>
<!-- 2014-04-30 Wed 17:09 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">Cool elisp hack!</h1>
<p>
November 21st, 2003 -
<a href="http://sachachua.com/blog/p/1380"><a href="http://sachachua.com/blog/p/1380">http://sachachua.com/blog/p/1380</a></a>
</p>

<p>
I've gotten the bot-like improvements I wanted thanks to these snippets
of elisp code:
</p>

<pre class="example">
(require 'hippie-exp)

(setq hippie-expand-try-functions-list
      '(sacha/try-expand-factoid-from-bbdb
        try-complete-file-name
        try-expand-all-abbrevs
        try-expand-dabbrev-from-kill
        try-expand-dabbrev-visible
        try-expand-dabbrev-all-buffers))

;; Particularly fun with ERC. I am now a bot!
(defun sacha/try-expand-factoid-from-bbdb (old)
  "Try to expand from BBDB. If OLD is non-nil, cycle through other possibilites."
  (unless old
      ;; First time, so search through the BBDB records for the factoid.
    (progn
      (he-init-string (he-dabbrev-beg) (point))
      (setq he-expand-list nil)
      (mapc
       (lambda (item)
         (setq he-expand-list (append he-expand-list (list (bbdb-record-getprop item 'blog))))
         (setq he-expand-list (append he-expand-list (list (bbdb-record-getprop item 'web))))
         (setq he-expand-list (append he-expand-list (list (car (bbdb-record-net item)))))
         (setq he-expand-list (append he-expand-list (list (bbdb-record-getprop item 'notes)))))
       (bbdb-search (bbdb-records) he-search-string he-search-string he-search-string he-search-string nil))
      (setq he-expand-list (delq nil he-expand-list))))
  (while (and he-expand-list
              (or (not (car he-expand-list))
                  (he-string-member (car he-expand-list) he-tried-table t)))
    (setq he-expand-list (cdr he-expand-list)))
  (if (null he-expand-list)
      (progn
        (if old (he-reset-string))
        nil)
    (progn
      (he-substitute-string (car he-expand-list) t)
      (setq he-expand-list (cdr he-expand-list))
      t)))
</pre>

<p>
hippie-expand inside an ERC buffer will then cycle through the blog,
web, net and notes fields of whatever entries I have. Yay! =)
</p>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
